test/fixtures/stripe_webhooks/customer.subscription.updated-custom.json


{
  "created": 1326853478,
  "livemode": false,
  "id": "evt_00000000000000",
  "type": "customer.subscription.updated",
  "object": "event",
  "data": {
    "object": {
      "id": "su_00000000000000",
      "plan": {
        "interval": "month",
        "name": "Member's Club",
        "amount": 100,
        "currency": "usd",
        "id": "fkx0AFo_00000000000000",
        "object": "plan",
        "livemode": false,
        "interval_count": 1,
        "trial_period_days": null
      },
      "object": "subscription",
      "start": 1381080561,
      "status": "active",
      "customer": "cus_00000000000000",
      "cancel_at_period_end": false,
      "current_period_start": 1381080561,
      "current_period_end": 1383758961,
      "ended_at": null,
      "trial_start": null,
      "trial_end": null,
      "canceled_at": null,
      "quantity": 1,
      "application_fee_percent": null
    },
    "previous_attributes": {
      "status": "unpaid"
    }
  }
}
